{
  "backend/main.mo": "Main backend actor implementing user data management with CRUD operations for chapters, time slots, performance blocks, consistency tracking, and War Mode stats. Includes migration support and comprehensive user data structure.",
  "backend/migration.mo": "Migration module that transforms old user data schema (with sleep entries and old time slots) to new schema (removing sleep data and adding chapter field to time slots).",
  "feature_evidence.json": "Feature evidence report documenting removal of AIR rank projection estimator from IntelligenceEngine, removal of SleepTracker component, removal of sleep-related React Query hooks, and addition of chapter name display to FlexibleScheduleGrid.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App, hooks, timers, trackers, analytics, chapter management, and dashboard components with their key features and functionality.",
  "frontend/index.css": "Tailwind CSS configuration with dark theme design system using OKLCH color tokens, custom CSS variables for light/dark modes, and base styling for background and foreground colors.",
  "frontend/index.html": "HTML entry point with inline loading spinner, viewport configuration, and failsafe script that detects React mount failures after 10 seconds and displays error message with reload option.",
  "frontend/src/App.tsx": "Main React application component with Internet Identity authentication, three-tab navigation (Overview, Chapters, Intelligence), mobile swipe gestures, comprehensive initialization error handling, and loading states.",
  "frontend/src/components/ConsistencyDNATracker.tsx": "Displays a circular progress tracker for user consistency with daily check-in buttons (consistent/inconsistent), calculates consistency score as percentage of consistent days, and handles IST timezone conversions.",
  "frontend/src/components/CountdownTimer.tsx": "Real-time countdown timer to JEE Advanced 2026 (May 17, 2026) showing days, hours, minutes, and seconds with critical styling when less than 30 days remain.",
  "frontend/src/components/DailyGoalTracker.tsx": "Empty file with no content.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors (especially BigInt serialization issues), logs detailed error information to console, and displays a user-friendly error UI with reload option.",
  "frontend/src/components/FlexibleScheduleGrid.tsx": "Manages time-blocked schedule with CRUD operations for time slots, supports activity types (study/break), tracks completion status, and converts between JavaScript Date and BigInt nanosecond timestamps.",
  "frontend/src/components/FocusStabilityIndex.tsx": "Calculates and displays a Focus Stability Index (FSI) score based on deep work hours (50%), task switching penalty (25%), and completion rate (25%) over the last 7 days, rendered as a circular progress indicator.",
  "frontend/src/components/IntelligenceEngine.tsx": "Displays AI-driven insights including weakness detection for incomplete high-importance chapters, burnout risk assessment based on recent study hours, and personalized daily suggestions for study improvement.",
  "frontend/src/components/IntelligentAlerts.tsx": "Shows dismissible alert cards for critical study issues (e.g., FSI drops) with severity indicators, icons, and actionable recommendations; displays success state when no alerts are active.",
  "frontend/src/components/MasterPCMChapterSystem.tsx": "Manages Physics, Chemistry, and Mathematics chapters with tabbed subject views, allowing users to add chapters, toggle completion status, and track three-stage revision progress (theory, PYQs, advanced practice).",
  "frontend/src/components/OverviewDashboard.tsx": "Displays high-level study metrics including total/completed chapters, completion percentages, subject-wise revision status, and integrates FlexibleScheduleGrid and ConsistencyDNATracker components.",
  "frontend/src/components/PerformanceAnalytics.tsx": "Empty file with no content.",
  "frontend/src/components/RevisionChecklist.tsx": "Provides a filterable list of chapters by subject and completion status, allowing users to toggle chapter completion with visual indicators and handles user registration if needed.",
  "frontend/src/components/SleepTracker.tsx": "Empty file with no content.",
  "frontend/src/components/TopPYQsTracker.tsx": "Empty file with no content.",
  "frontend/src/components/WarMode.tsx": "Implements a Pomodoro-style focused study timer with 50-minute work sessions and 10-minute breaks, tracking completed pomodoros and total study time with start/pause/skip controls and exit confirmation.",
  "frontend/src/components/WarModeConfigModal.tsx": "Modal dialog for configuring War Mode sessions with preset and custom duration options for focus time and optional breaks, including validation and two-step confirmation flow.",
  "frontend/src/components/WarModeScreen.tsx": "Full-screen War Mode timer component that manages focus and break phases with play/pause controls, tracks active focus time, and handles session completion or early exit with confirmation.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user registration, consistency tracking, chapter management, time slots, and War Mode statistics with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with dark theme color variables, mobile-responsive typography, touch-friendly spacing utilities, and accessibility optimizations for interactive elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/utils/bigIntSerializer.ts": "Provides utility functions to recursively convert BigInt values in objects/arrays to strings or numbers, and check if a value contains BigInt, preventing JSON serialization errors.",
  "frontend/src/utils/safeStringify.ts": "Exports safe JSON.stringify and JSON.parse wrappers that handle BigInt values by converting them to strings during serialization.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom OKLCH color system for UI components (primary, secondary, destructive, sidebar, etc.), extended animations, and typography/container-queries plugins.",
  "project_state.json": "Project state document describing a JEE Advanced 2026 preparation app with features like countdown timer, Focus Stability Index, performance analytics, War Mode, PCM chapter system, and daily goal tracker using React, Node.js, Express, MongoDB stack with dark-themed mobile-optimized UI."
}