{
  "backend/main.mo": "Motoko actor implementing backend for JEE study tracker with user registration, chapter management (PCM subjects with revision tracking for theory/PYQs/advanced practice), performance blocks, war mode stats (Pomodoro sessions), time slots, and consistency DNA tracking with daily entry validation.",
  "feature_evidence.json": "Feature evidence report documenting implemented War Mode features including the ENTER WAR MODE button, configuration modal with duration/break selectors, and integration with OverviewDashboard and WarModeConfigModal components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App.tsx (main auth/navigation), hooks for backend queries, countdown timer, Focus Stability Index, performance analytics, consistency DNA tracker, War Mode Pomodoro interface, chapter management system, daily goal tracker, revision checklist, and overview dashboard.",
  "frontend/index.css": "Tailwind CSS configuration with dark theme design system using OKLCH color tokens, custom CSS variables for light/dark modes, and base styles for background/foreground colors.",
  "frontend/index.html": "HTML entry point with inline loading spinner, viewport configuration, and failsafe script that detects React mount failures after 10 seconds and displays error message with reload button.",
  "frontend/src/App.tsx": "Main React application component managing Internet Identity authentication, two-tab navigation (overview/chapters), mobile swipe gestures, loading/error states with comprehensive console logging, and footer with caffeine.ai attribution.",
  "frontend/src/components/ConsistencyDNATracker.tsx": "Displays a circular progress tracker showing user consistency percentage based on days consistent vs. days tracked, with buttons to mark daily consistency and auto-registration for new users.",
  "frontend/src/components/CountdownTimer.tsx": "Shows a real-time countdown timer to JEE Advanced 2026 (May 17, 2026) with days, hours, minutes, and seconds, highlighting critical status when less than 30 days remain.",
  "frontend/src/components/DailyGoalTracker.tsx": "Manages daily time slots with CRUD operations, allowing users to create, edit, delete, and toggle completion of scheduled activities with start/end times and activity types.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors, displays detailed error information in development mode, and provides reload/retry options.",
  "frontend/src/components/FocusStabilityIndex.tsx": "Calculates and displays a Focus Stability Index (FSI) score based on deep work hours, task switching, distraction levels, sleep quality, and war mode usage, with trend indicators.",
  "frontend/src/components/MasterPCMChapterSystem.tsx": "Main chapter management component that allows users to add, view, edit, and delete chapters with properties like subject, difficulty, importance, and revision intervals. Includes completion toggling and handles user registration if not found.",
  "frontend/src/components/OverviewDashboard.tsx": "Dashboard component displaying overall study statistics including chapter completion percentages, subject-wise breakdowns, war mode study time, weak chapters, and revision coverage. Features a prominent 'Enter War Mode' button and integrates TopPYQsTracker.",
  "frontend/src/components/PerformanceAnalytics.tsx": "Analytics component that tracks and visualizes study performance across different time blocks (7-10 AM, 10-1 PM, etc.) using bar charts. Allows users to record focus scores and productivity for specific time periods.",
  "frontend/src/components/RevisionChecklist.tsx": "Checklist component for tracking chapter revision status with filtering by subject and completion status. Displays revision progress (theory, PYQs, advanced practice) and allows toggling chapter completion.",
  "frontend/src/components/TopPYQsTracker.tsx": "Component for tracking completion of Previous Year Questions (PYQs) by year. Allows users to toggle year completion status and add custom years between 2000-2026, displaying overall progress percentage.",
  "frontend/src/components/WarMode.tsx": "Implements a Pomodoro-style timer component with 50-minute work sessions and 10-minute breaks, tracking completed pomodoros and total study time with start/pause/skip controls and exit confirmation dialog.",
  "frontend/src/components/WarModeConfigModal.tsx": "Modal dialog for configuring War Mode session parameters including focus duration (preset or custom), optional break settings, and a confirmation step before starting a session.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient, managing identity state and delegation validation across the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user registration, consistency tracking, chapter management, performance blocks, time slots, and war mode statistics with toast notifications for user feedback.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with dark theme color variables, mobile-responsive typography, touch-friendly spacing utilities, and accessibility optimizations for interactive elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom color scheme using OKLCH color space (including sidebar, chart, and semantic colors), extended border radius variables, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a JEE Advanced 2026 preparation app with features including countdown timer, Focus Stability Index, performance analytics, War Mode, PCM chapter system with spaced repetition, daily goal tracker, and revision checklist, built with React, Node.js, Express, MongoDB, and Chart.js in a dark-themed mobile-optimized interface."
}