{
  "backend/main.mo": "Motoko backend actor implementing user registration, chapter management (CRUD with completion toggle), consistency DNA tracking with IST date validation, performance blocks, war mode stats, and time slots with Principal-based user data storage in a Map.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (dark UI, unified dashboard, countdown timer, Chemistry split, chapter management, consistency tracking, etc.) to source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their functionality including App.tsx (main component with auth and navigation), hooks, components (countdown, focus index, consistency tracker, war mode, chapter system, etc.), and styling.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color tokens for dark theme, defining CSS variables for background (#0f0f0f equivalent), card colors, primary/destructive/chart colors, borders, and sidebar styling for both light and dark modes.",
  "frontend/index.html": "HTML entry point with mobile-optimized viewport meta tag (maximum-scale=5.0, user-scalable=yes) and root div for React mounting.",
  "frontend/src/App.tsx": "Main React component with Internet Identity authentication, dark theme provider, two-tab navigation (Overview/Chapters), mobile swipe gestures, countdown timer integration, 44x44px touch targets, and footer with caffeine.ai attribution.",
  "frontend/src/components/ConsistencyDNATracker.tsx": "Circular progress component displaying consistency score with IST timezone validation to prevent multiple daily entries, showing disabled state with messaging when already marked today, and automatic re-enable at midnight with smooth transitions.",
  "frontend/src/components/CountdownTimer.tsx": "Displays a real-time countdown timer to JEE Advanced 2026 (May 17, 2026) with days, hours, minutes, and seconds, highlighting critical status when less than 30 days remain.",
  "frontend/src/components/DailyGoalTracker.tsx": "Manages daily time slots with CRUD operations for scheduling activities (study, break, exercise, etc.), allowing users to track completion status and calculate daily progress statistics.",
  "frontend/src/components/FocusStabilityIndex.tsx": "Calculates and displays a Focus Stability Index (FSI) score based on deep work hours, task switching, distraction levels, sleep quality, and war mode usage, with trend indicators.",
  "frontend/src/components/MasterPCMChapterSystem.tsx": "Provides a comprehensive chapter management system for Physics, Chemistry, and Mathematics subjects with filtering, completion tracking, and CRUD operations (edit/delete pending backend support).",
  "frontend/src/components/OverviewDashboard.tsx": "Displays high-level metrics including chapter completion percentage, PCM subject distribution, war mode study hours, and weak chapters requiring attention.",
  "frontend/src/components/PerformanceAnalytics.tsx": "React component that displays performance analytics with a bar chart showing focus and productivity scores across different time blocks (7-10 AM, 10-1 PM, etc.). Includes a dialog to record new performance blocks with sliders for focus and productivity scores.",
  "frontend/src/components/RevisionChecklist.tsx": "React component for managing chapter revisions with filtering by subject and status (due/completed). Implements spaced repetition logic (1, 7, 21 days) and allows bulk operations on chapters with visual status badges.",
  "frontend/src/components/WarMode.tsx": "Pomodoro timer component with 50-minute work sessions and 10-minute breaks. Tracks completed pomodoros and total study time, saving stats to backend on exit.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the ICP actor instance, creating authenticated or anonymous actors based on Internet Identity login state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status. Configures AuthClient with custom idle options and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user registration, consistency tracking, chapter management (CRUD operations), performance blocks, time slots, and war mode stats. Handles toast notifications and query invalidation.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for a dark theme color system using OKLCH values, and includes mobile-responsive optimizations with touch-friendly sizing and smooth transitions.",
  "frontend/src/main.tsx": "React application entry point that sets up the root render with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the default theme with custom OKLCH color variables, container settings, border radius utilities, custom animations for accordions, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state document describing a JEE Advanced 2026 preparation app with features including countdown timer, Focus Stability Index, performance analytics, War Mode, PCM chapter system, daily goal tracker, and revision checklist, built with React, Node.js, Express, MongoDB, optimized for Android mobile with dark theme UI."
}