{
  "kind": "build_request",
  "title": "Remove AIR rank projection, remove sleep tracker, and add chapter name to time blocks",
  "projectName": "JEE WAR ROOM",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-121",
      "text": "Remove the AIR rank projection estimator section from the IntelligenceEngine component. Delete all rank projection calculation logic, UI elements displaying projected rank range, confidence indicators, and contributing factors (chapter mastery, consistency, weak areas). Keep the weakness detection algorithm, burnout detection algorithm, and automated daily suggestions system intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "remove the air rank projection"
        ]
      },
      "acceptanceCriteria": [
        "AIR rank projection section is completely removed from IntelligenceEngine component",
        "No rank projection UI elements or calculations remain",
        "Weakness detection, burnout detection, and daily suggestions continue to function",
        "No console errors or broken references from removal"
      ]
    },
    {
      "id": "REQ-122",
      "text": "Remove the SleepTracker component from the OverviewDashboard. Delete the SleepTracker component file (frontend/src/components/SleepTracker.tsx) and remove all imports and references to it in OverviewDashboard and other components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "remove sleep tracker"
        ]
      },
      "acceptanceCriteria": [
        "SleepTracker component is completely removed from the application",
        "No imports or references to SleepTracker remain in any component",
        "OverviewDashboard renders without SleepTracker section",
        "No console errors from missing component"
      ]
    },
    {
      "id": "REQ-123",
      "text": "Remove the sleep quality factor (10%) from the Focus Stability Index (FSI) calculation formula. Update the FSI calculation to redistribute the weighting: 50% deep work hours, 25% task switching penalty, 25% distraction penalty. Remove all sleep-related data dependencies from FSI calculation logic.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "remove sleep quality (10%) from the FSI calculation formula"
        ]
      },
      "acceptanceCriteria": [
        "FSI calculation no longer includes sleep quality factor",
        "FSI formula correctly redistributes to 50% deep work, 25% task switching, 25% distraction",
        "FSI score continues to calculate and display correctly",
        "No references to sleep data in FSI backend logic"
      ]
    },
    {
      "id": "REQ-124",
      "text": "Remove all backend endpoints and data models related to sleep tracking. Delete sleep data storage structures, CRUD operations for sleep entries, and any queries that fetch sleep history. Remove the sleepData field from the UserData type in backend/main.mo.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "remove sleep tracker"
        ]
      },
      "acceptanceCriteria": [
        "All sleep tracking backend endpoints are removed",
        "sleepData field is removed from UserData type",
        "No sleep-related data persists in backend storage",
        "Backend compiles successfully without sleep tracking code"
      ]
    },
    {
      "id": "REQ-125",
      "text": "Remove all React Query hooks related to sleep tracking from frontend/src/hooks/useQueries.ts. Delete useSleepData, useCreateSleepEntry, and any other sleep-related query hooks. Remove all references to these hooks throughout the frontend codebase.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "remove sleep tracker"
        ]
      },
      "acceptanceCriteria": [
        "All sleep tracking React Query hooks are removed from useQueries.ts",
        "No imports or calls to sleep-related hooks remain in components",
        "React Query cache does not store any sleep-related data",
        "Application functions without sleep tracking queries"
      ]
    },
    {
      "id": "REQ-126",
      "text": "Add a chapter name display field to each time block card in the FlexibleScheduleGrid component. Display the selected chapter name prominently below the time range (05:40 AM - 08:50 AM) and above or alongside the subject field. The chapter name should be clearly visible and styled consistently with the dark theme. Use a slightly lighter text color than the time display for visual hierarchy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "in the image attach wright the name of the chapter"
        ]
      },
      "acceptanceCriteria": [
        "Chapter name is displayed within each time block card",
        "Chapter name appears below time range and is clearly readable",
        "Visual styling follows dark theme with appropriate text hierarchy",
        "Chapter name displays correctly on mobile screens (320px-480px width)",
        "Layout does not overflow or cause horizontal scrolling"
      ]
    },
    {
      "id": "REQ-127",
      "text": "Update the time block data model in the FlexibleScheduleGrid component to ensure the chapter field is always populated when a time block is created or edited. If the chapter field already exists in the data model but is not being displayed, wire it to the UI. If it does not exist, add it to the time block form and backend storage.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "in the image attach wright the name of the chapter"
        ]
      },
      "acceptanceCriteria": [
        "Time block data model includes chapter field",
        "Chapter field is required when creating/editing time blocks",
        "Chapter selection works correctly in add/edit modal",
        "Chapter name persists to backend and displays on time block cards"
      ]
    },
    {
      "id": "REQ-128",
      "text": "Update the FocusStabilityIndex component to reflect the new FSI calculation formula without sleep quality. Update any UI text, tooltips, or help information that previously mentioned sleep as a factor in FSI calculation. Ensure the circular progress meter and color-coded rings continue to display correctly with the updated formula.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "remove sleep quality (10%) from the FSI calculation formula"
        ]
      },
      "acceptanceCriteria": [
        "FocusStabilityIndex UI reflects updated calculation formula",
        "No references to sleep quality appear in FSI component",
        "FSI score displays correctly with new weighting",
        "Circular progress meter and color coding function properly"
      ]
    }
  ],
  "constraints": [
    "Do not modify the existing War Mode system or timer functionality",
    "Do not change the chapter management CRUD operations",
    "Keep all existing revision tracking logic (theory/PYQs/advanced practice toggles) intact",
    "Maintain the existing dark theme styling (#0f0f0f background, neon blue/orange accents)",
    "Preserve mobile responsiveness with 44x44px minimum touch targets",
    "Do not remove or modify the weakness detection, burnout detection, or daily suggestions features in IntelligenceEngine"
  ],
  "nonGoals": [
    "Adding new features beyond the three requested changes",
    "Modifying the Consistency DNA Tracker component",
    "Changing the War Mode configuration or screen",
    "Adding new sleep tracking functionality",
    "Redesigning the FSI calculation beyond removing sleep factor",
    "Modifying the overall Intelligence tab layout beyond removing rank projection"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}