{
  "kind": "build_request",
  "title": "Phase 1: Core UI, Overview Dashboard, Countdown, and Chapter Management",
  "projectName": "JEE War Room",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Implement dark UI layout with background color #0f0f0f, slightly lighter dark grey for cards and panels, consistent padding and margins (minimum 16px between major sections), and smooth transitions (200-300ms) on all interactive elements. Optimize for Android devices with touch targets minimum 44x44px and mobile-responsive design for screen widths 320px-480px.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "Dark UI layout",
          "Android-optimized responsive design, 44x44px minimum touch targets"
        ]
      },
      "acceptanceCriteria": [
        "Background color is #0f0f0f throughout the application",
        "Cards and panels use a slightly lighter dark grey than background",
        "All major sections have minimum 16px spacing between them",
        "All interactive elements have 200-300ms smooth transitions",
        "All touch targets are minimum 44x44px on mobile devices",
        "Layout is fully responsive and functional on screen widths from 320px to 480px"
      ]
    },
    {
      "id": "REQ-20",
      "text": "Create a unified Overview dashboard structure that consolidates chapter completion percentage, PCM ratio tracker, War Mode hours counter, and weak chapter alerts in a single screen. Do not include Focus Stability Index, Consistency DNA Tracker, revision module, Top PYQs section, or Performance vs Time graph.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "Overview dashboard structure",
          "Do not implement: Revision module, Top PYQs, War Mode, Consistency DNA, Focus Stability Index"
        ]
      },
      "acceptanceCriteria": [
        "Overview dashboard displays chapter completion percentage",
        "Overview dashboard displays PCM ratio tracker",
        "Overview dashboard displays War Mode hours counter",
        "Overview dashboard displays weak chapter alerts",
        "Focus Stability Index is not displayed on Overview dashboard",
        "Consistency DNA Tracker is not displayed on Overview dashboard",
        "Performance vs Time graph is not displayed anywhere",
        "All metrics are consolidated in a single unified screen layout"
      ]
    },
    {
      "id": "REQ-21",
      "text": "Implement real-time countdown timer to JEE Advanced 2026 exam on May 17, 2026, 9:00 AM IST. Display days, hours, minutes, and seconds in large digital font with updates every second. Timer text and styling must automatically turn red when fewer than 30 days remain.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "Real-time countdown: Updates every second to May 17, 2026, 9:00 AM IST, displays days/hours/minutes/seconds, turns red when <30 days remain"
        ]
      },
      "acceptanceCriteria": [
        "Countdown timer targets May 17, 2026, 9:00 AM IST",
        "Timer displays days, hours, minutes, and seconds",
        "Timer updates every second without page refresh",
        "Timer text is displayed in large digital font",
        "Timer automatically turns red when fewer than 30 days remain",
        "Timer styling and color change work correctly on mobile devices"
      ]
    },
    {
      "id": "REQ-22",
      "text": "Split Chemistry subject into three separate sections in the chapter management system: Physical Chemistry, Organic Chemistry, and Inorganic Chemistry. Each section must maintain independent chapter lists with full CRUD capabilities.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "Chemistry split into Physical / Organic / Inorganic"
        ]
      },
      "acceptanceCriteria": [
        "Chemistry is split into three distinct sections: Physical Chemistry, Organic Chemistry, and Inorganic Chemistry",
        "Each Chemistry section displays its own independent list of chapters",
        "Users can add, edit, and delete chapters within each Chemistry section independently",
        "Backend data model supports storing chapters under Physical, Organic, and Inorganic Chemistry categories",
        "Chapter completion percentage calculations account for all three Chemistry sections separately"
      ]
    },
    {
      "id": "REQ-23",
      "text": "Implement full chapter management system with modal-based editing. For each chapter, users must be able to edit chapter name, status (Not Started, In Progress, Completed, Revised Once, Revised Twice, Mastered), weakness level (Weak, Moderate, Strong), accuracy percentage, and last revision date through modal dialogs. Include delete chapter functionality with confirmation modal, and add custom chapter functionality with validation.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "Chapter management system with full modal editing",
          "Full modal-based editing for chapter name, status, weakness level, accuracy %, and revision date. Chemistry split into Physical/Organic/Inorganic. Delete with confirmation, add custom chapters with validation"
        ]
      },
      "acceptanceCriteria": [
        "Edit chapter functionality opens in a modal dialog",
        "Modal allows editing chapter name with text input",
        "Modal allows editing chapter status with dropdown or select (Not Started, In Progress, Completed, Revised Once, Revised Twice, Mastered)",
        "Modal allows editing weakness level with dropdown or select (Weak, Moderate, Strong)",
        "Modal allows editing accuracy percentage with number input (0-100)",
        "Modal allows editing last revision date with date picker",
        "Delete chapter button opens confirmation modal before deletion",
        "Add custom chapter functionality opens modal with form validation for required fields",
        "All modal interactions work correctly on Android mobile devices with touch input",
        "Backend API supports updating chapter name, status, weakness, accuracy, and revision date",
        "Backend API supports deleting chapters by ID",
        "Backend API supports creating new custom chapters with validation"
      ]
    },
    {
      "id": "REQ-24",
      "text": "Implement dynamic chapter completion percentage calculation that updates in real-time as chapter status changes. Calculate completion percentage based on the number of chapters marked as Completed, Revised Once, Revised Twice, or Mastered divided by total number of chapters across all subjects (Physics, Physical Chemistry, Organic Chemistry, Inorganic Chemistry, Mathematics). Display the percentage prominently on the Overview dashboard and update immediately when any chapter status is modified.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "Dynamic chapter completion percentage",
          "Dynamic Chapter Completion %: Real-time calculation based on chapter status (Not Started, In Progress, Completed, Revised Once, Revised Twice, Mastered)"
        ]
      },
      "acceptanceCriteria": [
        "Chapter completion percentage is calculated as (completed chapters / total chapters) * 100",
        "Completed chapters include those with status: Completed, Revised Once, Revised Twice, or Mastered",
        "Calculation includes chapters from all subjects: Physics, Physical Chemistry, Organic Chemistry, Inorganic Chemistry, and Mathematics",
        "Percentage displays prominently on Overview dashboard",
        "Percentage updates immediately when any chapter status is changed through edit modal",
        "Percentage updates immediately when new chapters are added or deleted",
        "Backend API returns accurate chapter completion percentage on user data fetch",
        "Frontend recalculates and displays updated percentage without requiring page refresh"
      ]
    }
  ],
  "constraints": [
    "Do not implement Focus Stability Index in this phase",
    "Do not implement Consistency DNA Tracker in this phase",
    "Do not implement Revision module with Theory/PYQs/Advanced tracking in this phase",
    "Do not implement Top PYQs section in this phase",
    "Do not implement War Mode functionality in this phase",
    "Do not implement Performance vs Time graph in this phase",
    "All chapter edits must open in modal dialogs, not inline editing",
    "Backend must use single-actor Motoko architecture with all logic in main actor file",
    "Frontend must not modify immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui"
  ],
  "nonGoals": [
    "Implementing revision tracking with Theory/PYQs/Advanced categories",
    "Creating Top PYQs section with year-based tracking",
    "Building War Mode with custom duration and break options",
    "Adding Focus Stability Index calculations and display",
    "Adding Consistency DNA Tracker with daily validation",
    "Implementing Performance vs Time graph with 5 daily blocks",
    "Adding confirmation pop-ups for War Mode entry/exit",
    "Implementing PWA functionality for home screen installation"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}