{
  "kind": "build_request",
  "title": "Add visual revision tracking toggles for Theory, PYQs, and Advanced Practice to chapter display",
  "projectName": "JEE WAR ROOM",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-94",
      "text": "Update the MasterPCMChapterSystem component to display three prominent toggle buttons or checkboxes for each chapter showing Theory, PYQs, and Advanced Practice completion status. Each toggle must visually indicate completion state with a green checkmark icon when true and a red cross or empty state when false.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "no option to tick or cross theory pyqs and advanced options so change that",
          "yuup"
        ]
      },
      "acceptanceCriteria": [
        "Each chapter card or detail view displays three separate toggle controls labeled 'Theory', 'PYQs', and 'Advanced Practice'",
        "When a field is marked complete (true), display a green checkmark icon (✓)",
        "When a field is incomplete (false), display a red cross icon (✗) or empty checkbox state",
        "Toggles must be easily tappable on mobile devices with minimum 44x44px touch targets",
        "The visual state updates immediately when toggled without page refresh"
      ]
    },
    {
      "id": "REQ-95",
      "text": "Wire the revision tracking toggles to call the backend updateChapterRevision endpoint when any toggle is clicked. Pass the chapter ID and the specific field being updated (theoryCompleted, pyqsCompleted, or advancedPracticeCompleted) with the new boolean value.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "no option to tick or cross theory pyqs and advanced options"
        ]
      },
      "acceptanceCriteria": [
        "Clicking any revision toggle immediately calls the backend mutation",
        "Backend updates the specific boolean field for the target chapter",
        "React Query invalidates chapter queries and refetches updated data",
        "UI reflects the new state with updated toggle visual indicators",
        "Error handling displays user-friendly messages if the update fails"
      ]
    },
    {
      "id": "REQ-96",
      "text": "Display the calculated revision coverage percentage (0-100%) for each chapter alongside the toggle buttons. The percentage must be calculated as (number of completed revision fields / 3) × 100 and update in real-time when any toggle changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ]
      },
      "acceptanceCriteria": [
        "Each chapter displays a revision percentage badge or indicator",
        "Percentage calculation: if all three toggles are true, shows 100%; if two are true, shows 67%; if one is true, shows 33%; if none are true, shows 0%",
        "Percentage updates immediately when any toggle is clicked without requiring page refresh",
        "The percentage display is clearly visible and styled to match the dark theme"
      ]
    },
    {
      "id": "REQ-97",
      "text": "Ensure the revision toggle UI integrates seamlessly with the existing chapter display layout in MasterPCMChapterSystem. Position the toggles prominently within each chapter card or expanded detail view without causing layout overflow or horizontal scrolling on mobile screens (320px-480px width).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ]
      },
      "acceptanceCriteria": [
        "Revision toggles are positioned in a logical location within each chapter card (e.g., below chapter name and status, above or beside other chapter metadata)",
        "Layout remains responsive and does not break on small Android screens",
        "No horizontal scrolling is introduced by the toggle controls",
        "All text labels and icons remain readable at mobile viewport sizes",
        "Spacing between toggles and other chapter elements follows the consistent 16px padding standard"
      ]
    }
  ],
  "constraints": [
    "Do not modify the backend Chapter type structure; theoryCompleted, pyqsCompleted, and advancedPracticeCompleted fields already exist",
    "Do not alter the existing backend updateChapterRevision endpoint; use it as-is",
    "Maintain the existing dark theme styling with #0f0f0f background and neon accent colors",
    "Preserve all existing chapter management functionality (edit, delete, status changes)",
    "Do not modify any immutable frontend paths listed in SYSTEM_CONTEXT"
  ],
  "nonGoals": [
    "Adding new backend endpoints for revision tracking (already implemented)",
    "Modifying the global revision coverage calculation logic on the Overview dashboard",
    "Changing the PYQ years tracking system or TopPYQsTracker component",
    "Adding new revision tracking fields beyond the existing three (theory, PYQs, advanced practice)",
    "Implementing bulk revision marking actions",
    "Adding revision scheduling or notification features"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}