{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Phase 3 Step 1: War Mode Entry UI with Duration and Break Configuration",
  "requirements": [
    {
      "id": "REQ-55",
      "summary": "Add 'ENTER WAR MODE' button to OverviewDashboard component with neon blue styling and mobile-optimized touch target",
      "acceptanceCriteria": [
        "Button displays 'ENTER WAR MODE' text with appropriate styling",
        "Button uses neon blue accent color from the theme",
        "Button meets minimum 44x44px touch target requirement for mobile",
        "Clicking the button opens the War Mode configuration modal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OverviewDashboard.tsx",
          "operation": "modify",
          "description": "Add 'ENTER WAR MODE' button near the top of the dashboard component, positioned prominently after the title and before the statistics cards. Style with neon blue accent color (using existing theme colors from index.css), ensure minimum 44x44px touch target with appropriate padding, and wire the button to open the War Mode configuration modal using state management."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Create War Mode configuration modal with duration selector featuring preset buttons and custom input",
      "acceptanceCriteria": [
        "Modal opens when 'ENTER WAR MODE' button is clicked",
        "Three preset buttons display: 60m, 90m, 120m",
        "Custom input field accepts numeric values for minutes",
        "Only one duration option (preset or custom) can be selected at a time",
        "Selected duration is visually highlighted",
        "Modal matches dark theme styling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WarModeConfigModal.tsx",
          "operation": "create",
          "description": "Create a new War Mode configuration modal component using the shadcn-ui Dialog component. Verify the component's usage instructions before implementing. Include state management for modal open/close, duration selection (preset vs custom), break toggle, and break duration. Implement duration selector section with three preset buttons (60m, 90m, 120m) and a custom input field for entering minutes. Ensure only one duration option can be selected at a time with visual highlighting. Style with dark theme background (#0f0f0f) and slightly lighter grey content area matching the existing application theme."
        },
        {
          "path": "frontend/src/components/OverviewDashboard.tsx",
          "operation": "modify",
          "description": "Import and integrate the WarModeConfigModal component. Add state for controlling modal visibility. Wire the 'ENTER WAR MODE' button click handler to open the modal. Pass necessary props to the modal component for configuration data handling."
        }
      ]
    },
    {
      "id": "REQ-57",
      "summary": "Add 'Break needed?' toggle section to configuration modal with Yes/No options controlling break duration selector visibility",
      "acceptanceCriteria": [
        "Toggle section displays below duration selector",
        "Two buttons labeled 'Yes' and 'No' are clearly visible",
        "Only one option can be selected at a time",
        "Default selection is 'No'",
        "Break duration selector is hidden when 'No' is selected",
        "Break duration selector appears when 'Yes' is selected"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WarModeConfigModal.tsx",
          "operation": "modify",
          "description": "Add 'Break needed?' toggle section below the duration selector with two clearly visible option buttons labeled 'Yes' and 'No'. Implement state management with default selection set to 'No'. Ensure only one option can be selected at a time with visual highlighting. Add conditional rendering logic to control break duration selector visibility based on toggle state (hidden when 'No', visible when 'Yes')."
        }
      ]
    },
    {
      "id": "REQ-58",
      "summary": "Implement conditional break duration selector with preset buttons and custom input",
      "acceptanceCriteria": [
        "Break duration selector only displays when 'Break needed?' is 'Yes'",
        "Three preset buttons display: 5m, 10m, 15m",
        "Custom input field accepts numeric values for minutes",
        "Only one break duration option can be selected at a time",
        "Selected break duration is visually highlighted",
        "Break duration selector is completely hidden when 'No' is selected"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WarModeConfigModal.tsx",
          "operation": "modify",
          "description": "Add break duration selector section that conditionally renders when 'Break needed?' is set to 'Yes'. Include three preset buttons (5m, 10m, 15m) and a custom input field for entering break duration in minutes. Use the same styling pattern and layout structure as the focus duration selector. Implement state management to ensure only one break duration option can be selected at a time with visual highlighting. Ensure the section is completely hidden when 'No' is selected for break toggle."
        }
      ]
    },
    {
      "id": "REQ-59",
      "summary": "Add confirmation flow with settings summary and two-step modal confirmation process",
      "acceptanceCriteria": [
        "Configuration modal includes a 'Continue' or 'Next' button at the bottom",
        "Clicking continues to confirmation modal showing settings summary",
        "Confirmation modal displays selected focus duration",
        "Confirmation modal displays break status (Yes/No)",
        "Confirmation modal displays break duration if break is enabled",
        "Confirmation modal has 'Confirm & Enter War Mode' and 'Cancel' buttons",
        "Cancel returns to configuration modal",
        "Confirm closes both modals (no War Mode screen transition yet)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WarModeConfigModal.tsx",
          "operation": "modify",
          "description": "Add a 'Continue' or 'Next' button at the bottom of the configuration form. Implement state management to track configuration vs confirmation view. When clicked, transition to confirmation view showing a summary of selected settings including focus duration, break status (Yes/No), and break duration if enabled. The confirmation view should be part of the same modal component using conditional rendering."
        },
        {
          "path": "frontend/src/components/WarModeConfigModal.tsx",
          "operation": "modify",
          "description": "Implement confirmation view within the modal that displays when user proceeds from configuration. Show formatted summary of focus duration, break enabled status, and break duration (if applicable). Add 'Confirm & Enter War Mode' and 'Cancel' buttons. Wire 'Cancel' to return to configuration view. Wire 'Confirm & Enter War Mode' to close the modal entirely without triggering any War Mode screen transition (as War Mode screen is not implemented in this phase)."
        }
      ]
    },
    {
      "id": "REQ-60",
      "summary": "Implement form validation for focus duration and break duration with error messaging",
      "acceptanceCriteria": [
        "Cannot proceed without selecting a focus duration",
        "Custom focus duration must be a positive integer >= 1",
        "If break is enabled, break duration must be selected",
        "Custom break duration must be a positive integer >= 1",
        "Clear validation error messages display for invalid inputs",
        "Validation occurs before opening confirmation modal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WarModeConfigModal.tsx",
          "operation": "modify",
          "description": "Add validation logic that runs when user clicks 'Continue' button. Ensure focus duration is selected (either preset or custom). If custom duration is used, validate it is a positive integer >= 1. If break is enabled, validate that break duration is selected with the same rules (positive integer >= 1 for custom). Display clear validation error messages using shadcn-ui toast or inline error displays when validation fails. Prevent transition to confirmation view until all validation passes."
        }
      ]
    },
    {
      "id": "REQ-61",
      "summary": "Ensure full mobile responsiveness with optimized touch targets and no horizontal scrolling",
      "acceptanceCriteria": [
        "All buttons meet minimum 44x44px touch target size",
        "Modal content fits within mobile viewport without horizontal scroll",
        "Input fields are large enough for easy mobile interaction",
        "Spacing between interactive elements prevents accidental taps",
        "Modal displays correctly on screens 320px-480px wide",
        "Text remains readable at mobile font sizes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WarModeConfigModal.tsx",
          "operation": "modify",
          "description": "Apply mobile-responsive design patterns throughout the modal component. Ensure all buttons and interactive elements meet minimum 44x44px touch target size. Use responsive padding and spacing to prevent accidental taps. Apply Tailwind responsive utilities to ensure modal content fits within mobile viewport (320px-480px) without horizontal scrolling. Use appropriate text sizes that remain readable on mobile screens. Test input field sizes for easy mobile interaction."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add any additional mobile-specific utility classes or touch target helpers needed for the War Mode configuration modal if the existing 44x44px touch target utilities are insufficient. Ensure modal-specific responsive breakpoints align with the 320px-480px mobile range."
        }
      ]
    }
  ]
}