{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add visual revision tracking toggles for Theory, PYQs, and Advanced Practice to chapter display",
  "requirements": [
    {
      "id": "REQ-94",
      "summary": "Update MasterPCMChapterSystem to display three prominent toggle buttons (Theory, PYQs, Advanced Practice) with visual completion indicators (green checkmark when true, red cross when false)",
      "acceptanceCriteria": [
        "Each chapter card or detail view displays three separate toggle controls labeled 'Theory', 'PYQs', and 'Advanced Practice'",
        "When a field is marked complete (true), display a green checkmark icon (✓)",
        "When a field is incomplete (false), display a red cross icon (✗) or empty checkbox state",
        "Toggles must be easily tappable on mobile devices with minimum 44x44px touch targets",
        "The visual state updates immediately when toggled without page refresh"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MasterPCMChapterSystem.tsx",
          "operation": "modify",
          "description": "Add three toggle buttons for each chapter displaying theoryCompleted, pyqsCompleted, and advancedPracticeCompleted status. Display green checkmark icon (✓) when true and red cross icon (✗) when false. Ensure 44x44px minimum touch targets for mobile usability. Position toggles prominently within each chapter card below the chapter name and status fields. Use existing dark theme colors from index.css with neon accents for active states."
        }
      ]
    },
    {
      "id": "REQ-95",
      "summary": "Wire revision tracking toggles to call updateChapterRevision backend method when clicked, passing chapter ID and updated boolean field",
      "acceptanceCriteria": [
        "Clicking any revision toggle immediately calls the backend mutation",
        "Backend updates the specific boolean field for the target chapter",
        "React Query invalidates chapter queries and refetches updated data",
        "UI reflects the new state with updated toggle visual indicators",
        "Error handling displays user-friendly messages if the update fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation hook useUpdateChapterRevision that wraps the backend updateChapterRevision method. Accept chapterId and the three boolean fields (theoryCompleted, pyqsCompleted, advancedPracticeCompleted) as parameters. Invalidate getAllChapters query on success to trigger refetch. Include error handling that returns user-friendly error messages. Handle BigInt serialization for chapterId using existing bigIntSerializer utilities."
        },
        {
          "path": "frontend/src/components/MasterPCMChapterSystem.tsx",
          "operation": "modify",
          "description": "Import and use the useUpdateChapterRevision mutation hook. Wire each toggle button onClick handler to call the mutation with the chapter ID and updated boolean values for the specific field being toggled. On mutation success, the UI will automatically update via React Query refetch. Display error messages using existing error handling patterns if the mutation fails. Ensure optimistic UI updates are not used to prevent inconsistent state."
        }
      ]
    },
    {
      "id": "REQ-96",
      "summary": "Display calculated revision coverage percentage (0-100%) for each chapter based on completed revision fields, updating in real-time when toggles change",
      "acceptanceCriteria": [
        "Each chapter displays a revision percentage badge or indicator",
        "Percentage calculation: if all three toggles are true, shows 100%; if two are true, shows 67%; if one is true, shows 33%; if none are true, shows 0%",
        "Percentage updates immediately when any toggle is clicked without requiring page refresh",
        "The percentage display is clearly visible and styled to match the dark theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MasterPCMChapterSystem.tsx",
          "operation": "modify",
          "description": "Add a utility function calculateRevisionPercentage that takes a Chapter object and returns the percentage as (count of true revision fields / 3) × 100, rounded to nearest integer. Display the calculated percentage as a badge next to each chapter name using existing badge styling from the dark theme. Position the percentage badge prominently so it's visible alongside the chapter metadata. The percentage will automatically update when React Query refetches chapter data after mutation success."
        }
      ]
    },
    {
      "id": "REQ-97",
      "summary": "Ensure revision toggle UI integrates seamlessly with existing chapter layout, remaining responsive on mobile screens (320px-480px) without overflow or horizontal scrolling",
      "acceptanceCriteria": [
        "Revision toggles are positioned in a logical location within each chapter card (e.g., below chapter name and status, above or beside other chapter metadata)",
        "Layout remains responsive and does not break on small Android screens",
        "No horizontal scrolling is introduced by the toggle controls",
        "All text labels and icons remain readable at mobile viewport sizes",
        "Spacing between toggles and other chapter elements follows the consistent 16px padding standard"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MasterPCMChapterSystem.tsx",
          "operation": "modify",
          "description": "Arrange the three revision toggles in a flex container with flex-wrap to prevent horizontal overflow on narrow screens. Position the toggle container below the chapter name and completion status, maintaining 16px padding between elements as defined in existing layout standards. Use responsive Tailwind classes to stack toggles vertically on screens below 480px width. Ensure all toggle labels and icons remain legible with appropriate font sizes (minimum 14px) and sufficient contrast against the #0f0f0f background. Test layout behavior at 320px, 375px, and 480px viewport widths to verify no horizontal scrolling occurs."
        }
      ]
    }
  ]
}