{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove AIR rank projection, remove sleep tracker, and add chapter name to time blocks",
  "requirements": [
    {
      "id": "REQ-121",
      "summary": "Remove AIR rank projection estimator from IntelligenceEngine component while preserving weakness detection, burnout detection, and daily suggestions",
      "acceptanceCriteria": [
        "AIR rank projection section is completely removed from IntelligenceEngine component",
        "No rank projection UI elements or calculations remain",
        "Weakness detection, burnout detection, and daily suggestions continue to function",
        "No console errors or broken references from removal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/IntelligenceEngine.tsx",
          "operation": "modify",
          "description": "Remove all rank projection calculation logic, UI elements displaying projected rank range, confidence indicators, and contributing factors. Delete any state variables, helper functions, and JSX sections related to rank projection. Preserve the weakness detection algorithm (incomplete high-importance chapters), burnout risk assessment, and daily study suggestions functionality intact."
        }
      ]
    },
    {
      "id": "REQ-122",
      "summary": "Remove SleepTracker component from OverviewDashboard and delete the component file",
      "acceptanceCriteria": [
        "SleepTracker component is completely removed from the application",
        "No imports or references to SleepTracker remain in any component",
        "OverviewDashboard renders without SleepTracker section",
        "No console errors from missing component"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OverviewDashboard.tsx",
          "operation": "modify",
          "description": "Remove the import statement for SleepTracker component and delete the JSX element that renders it. Ensure the dashboard layout remains intact with FlexibleScheduleGrid and ConsistencyDNATracker components."
        },
        {
          "path": "frontend/src/components/SleepTracker.tsx",
          "operation": "delete",
          "description": "Delete the SleepTracker component file completely as it is no longer needed in the application."
        }
      ]
    },
    {
      "id": "REQ-125",
      "summary": "Remove all sleep tracking React Query hooks from useQueries.ts",
      "acceptanceCriteria": [
        "All sleep tracking React Query hooks are removed from useQueries.ts",
        "No imports or calls to sleep-related hooks remain in components",
        "React Query cache does not store any sleep-related data",
        "Application functions without sleep tracking queries"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Delete useSleepData, useCreateSleepEntry, and any other sleep-related query hooks from the file. Remove any import statements or type definitions specific to sleep tracking. Ensure all remaining hooks continue to function properly."
        }
      ]
    },
    {
      "id": "REQ-126",
      "summary": "Display chapter name prominently within each time block card in FlexibleScheduleGrid",
      "acceptanceCriteria": [
        "Chapter name is displayed within each time block card",
        "Chapter name appears below time range and is clearly readable",
        "Visual styling follows dark theme with appropriate text hierarchy",
        "Chapter name displays correctly on mobile screens (320px-480px width)",
        "Layout does not overflow or cause horizontal scrolling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FlexibleScheduleGrid.tsx",
          "operation": "modify",
          "description": "Add a chapter name display field to each time block card. Position it below the time range display (e.g., '05:40 AM - 08:50 AM') and above or alongside the subject field. Use a slightly lighter text color than the time display for visual hierarchy while maintaining dark theme consistency (#0f0f0f background with neon blue/orange accents). Ensure the chapter field from the TimeSlot data model is wired to this display. Apply responsive styling to prevent overflow on mobile screens (320px-480px width) with 44x44px minimum touch targets maintained."
        }
      ]
    },
    {
      "id": "REQ-127",
      "summary": "Ensure time block data model includes chapter field and it is populated during create/edit operations",
      "acceptanceCriteria": [
        "Time block data model includes chapter field",
        "Chapter field is required when creating/editing time blocks",
        "Chapter selection works correctly in add/edit modal",
        "Chapter name persists to backend and displays on time block cards"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FlexibleScheduleGrid.tsx",
          "operation": "modify",
          "description": "Verify that the chapter field in the TimeSlot interface (from backend.d.ts) is properly wired in the add/edit modal forms. Ensure the chapter field is required when creating or editing time blocks. If a chapter dropdown or input is missing from the modal, add it with proper validation. Confirm that the chapter value is passed to the backend addTimeSlot and updateTimeSlot methods and that it displays correctly on time block cards after persistence."
        }
      ]
    },
    {
      "id": "REQ-128",
      "summary": "Update FocusStabilityIndex component to reflect new FSI calculation formula without sleep quality",
      "acceptanceCriteria": [
        "FocusStabilityIndex UI reflects updated calculation formula",
        "No references to sleep quality appear in FSI component",
        "FSI score displays correctly with new weighting",
        "Circular progress meter and color coding function properly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FocusStabilityIndex.tsx",
          "operation": "modify",
          "description": "Update the component to reflect the new FSI calculation formula: 50% deep work hours, 25% task switching penalty, 25% distraction penalty (with sleep quality removed). Remove any UI text, tooltips, labels, or help information that previously mentioned sleep as a factor. Ensure the circular progress meter and color-coded rings continue to display correctly with the updated formula. Maintain the dark theme styling and mobile responsiveness."
        }
      ]
    }
  ]
}